Repository: wolandius/token-manager
Catalog: data/locale/*.po
Languages: ru

source: CIPF Crypto Pro CSP or some of its components are not installed for
ru: СКЗИ КриптоПро CSP или некоторые его компоненты не установлены для

source: The current version of CIPF Crypto Pro CSP is not supported.
ru: Текущая версия СКЗИ КриптоПро CSP не поддерживается.

source: Select key media or vault
ru: Выберите ключевой носитель или хранилище

source: Select certificate container
ru: Выберите контейнер сертификата

source: Select certificate
ru: Выберите сертификат

source: issued
ru: изданный

source: organization
ru: организация

source: Selected
ru: Выбрано

source: container(s), please select only 1
ru: контейнер(ы), пожалуйста, выберите только 1

source: Operation canceled by user
ru: Операция отменена пользователем

source: The certificate was successfully copied to the container
ru: Сертификат успешно скопирован в контейнер

source: Tokens not found
ru: Токены не найдены

source: Certificate removed successfully
ru: Сертификат успешно удален

source: <b>Issuer</b>
ru: <b>Эмитент</b>

source: <b>Subject</b>:
ru: <b>Субъект</b>:

source: Serial number
ru: Серийный номер

source: Not valid until
ru: Не действителен до

source: Not valid after
ru: Не действителен после

source: <b>Advanced key usage</b>:
ru: <b>Расширенное использование ключа</b>:

source: <i>Does not have</i>
ru: <i>Не имеет</i>

source: <b>Required Root Certificates</b>:
ru: <b>Необходимые корневые сертификаты</b>:

source: <b>Required CRLs</b>:
ru: <b>Необходимые CRL</b>:

source: View
ru: Просмотр

source: Certificate
ru: Сертификат

source: The public part of the certificate was not found
ru: Открытая часть сертификата не найдена

source: View CryptoPRO CSP license
ru: Посмотреть лицензию КриптоПРО CSP

source: License
ru: Лицензия

source: <key carriers not found>
ru: <ключевые носители не найдены>

source: You must select 1 storage to complete the export
ru: Вы должны выбрать 1 хранилище для завершения экспортирования

source: Name not entered
ru: Имя не введено

source: Please choose only 1 container
ru: Пожалуйста, выберите только 1 контейнер

source: No containers selected
ru: Контейнеры не выбраны

source: No storage found in hdimage
ru: Не найдено хранилищ в hdimage

source: Certificate successfully exported
ru: Сертификат успешно экспортирован

source: Vaults not found
ru: Хранилища не найдены

source: container(s), prepare to enter passwords for containers several times and select certificates of the public part of the key (if they are not installed automatically
ru: контейнер(ы), подготовьтесь к вводу паролей для контейнеров несколько раз и выберите сертификаты открытой части ключа (если они не установлены автоматически

source: You need to select 1 storage to complete the export
ru: Вам нужно выбрать 1 хранилище завершить экспорт

source: Wrong path selected, operation canceled
ru: Выбран неправильный путь, операция отменена

source: No containers found related to the usb-flash drive
ru: Не найдено контейнеров, связанных с usb-flash накопителем

source: Reconnect the usb-flash drive and repeat the operation
ru: Переподключите usb-флешку и повторить операцию

source: domain users
ru: доменные пользователи

source: Successfully installed root certificates:
ru: Успешно установлены корневые сертификаты:

source: Successfully installed CRLs:
ru: Успешно установлены CRL:

source: Error installing root certificates:
ru: Ошибка установки корневых сертификатов:

source: Error installing CRLs:
ru: Ошибка установки CRL:

source: Certificate installed successfully
ru: Сертификат успешно установлен

source: Root certificates
ru: Корневые сертификаты

source: Root certificates storage
ru: Хранение корневых сертификатов

source: Personal certificates storage
ru: Хранение персональных сертификатов

source: <No Key Carriers Found>
ru: <Ключевые носители не найдены>

source: serial
ru: серийный

source: PIN code changed successfully
ru: PIN-код успешно изменен

source: PIN code saved successfully
ru: PIN-код успешно сохранен

source: Type to filter...
ru: Введите для фильтрации...

source: Issuer
ru: Заявитель

source: Subject
ru: Субъект

source: Basic information
ru: Основная информация

source: Not available until
ru: Не доступен до

source: Not available after
ru: Не доступен после

source: SHA1 fingerprint
ru: SHA1 отпечаток

source: SHA1 hash
ru: SHA1 хэш

source: Dates
ru: Даты

source: Date of issue
ru: Дата выдачи

source: Update date
ru: Дата обновления

source: Choose file(s)
ru: Выберите файл(ы)

source: Certificates
ru: Сертификаты

source: An error has occurred
ru: Произошла ошибка

source: License key successfully installed
ru: Лицензионный ключ успешно установлен

source: SHA1 Fingerprint
ru: SHA1 отпечаток

source: Root certificate installed
ru: Установлен корневой сертификат

source: CRLs installed
ru: CRL установлены

source: Containers
ru: Контейнеры

source: Vaults
ru: Хранилища

source: Select user certificate
ru: Выберите сертификат пользователя

source: You need to select 1 container to set up binding
ru: Вам нужно выбрать 1 контейнер установить привязку

source: The certificate was successfully associated with the container.
ru: Сертификат был успешно связан с контейнером.

source: Container successfully copied and associated with the certificate.
ru: Контейнер успешно скопирован и связаны с сертификатом.

source: Select directory
ru: Выберите каталог

source: Configure udev rule for
ru: Настройка правила udev для

source: Copyright (c) 2017 Boris Makarenko Copyright (c) 2020-2023 Vladlen Murylev
ru: Copyright (c) 2017 Борис Макаренко Copyright (c) 2020-2023 Владлен Мурылев

source: Install root certificates
ru: Установить корневые сертификаты

source: Install CRLs
ru: Установить CRL

source: Write a certificate to a container
ru: Записать сертификат в контейнер

source: Export certificate from container
ru: Экспорт сертификата из контейнера

source: Associate a certificate with a container
ru: Связать сертификат с контейнером

source: View Root Certificates
ru: Просмотр корневых сертификатов

source: View CRLs
ru: Просмотр CRL

source: Copy container from token
ru: Скопировать контейнер из токена

source: Copy container from usb flash drive
ru: Скопировать контейнер с флешки

source: Copy container from HDIMAGE to token
ru: Скопировать контейнер из HDIMAGE на токен

source: Enter CryptoPRO license
ru: Введите лицензию КриптоПРО

source: View CryptoPRO license
ru: Посмотреть лицензию КриптоПРО

source: Install CryptoPRO CSP
ru: Установить КриптоПРО CSP

source: Work with CryptoPRO CSP certificates
ru: Работа с сертификатами КриптоПРО CSP

source: Key media and certificates
ru: Ключевые носители и сертификаты

source: Useful links
ru: Полезные ссылки

source: About
ru: О программе

source: Update
ru: Обновить

source: Save PIN
ru: Сохранить PIN-код

source: Change PIN
ru: Изменить PIN-код

source: Delete
ru: Удалить

source: Install
ru: Установить

source: Confirmation
ru: Подтверждение

source: The certificate has been successfully installed.
ru: Сертификат успешно установлен.

source: Would you like to install the required additional certificates?
ru: Хотите установить необходимые дополнительные сертификаты?

source: Question
ru: Вопрос

source: Install certificate(s) for local user (uMy storage) or all at once (mMy storage)?
ru: Установить сертификат(ы) для локального пользователя (хранилище uMy) или для всех сразу (хранилище mMy)?

source: Local
ru: Локально

source: For all
ru: Для всех

source: Install certificate(s) for local user or for all at once? (mRoot storage)
ru: Установить сертификат(ы) для локального пользователя или для всех сразу? (хранилище mRoot)

source: Type PIN-code
ru: Введите PIN-код

source: Enter the password of the root user, after applying you will need to reconnect the usb-flash drive
ru: Введите пароль пользователя root, после применения нужно будет переподключить usb-flash накопитель

source: Select 1 storage to export container
ru: Выберите 1 хранилище для экспорта контейнера

source: Select file(s)
ru: Выбрать файл(ы)

source: Are you sure you want to remove this certificate from the key carrier? This operation cannot be undone.
ru: Вы уверены, что хотите удалить этот сертификат с носителя ключей? Эту операцию нельзя будет отменить.

source: Are you sure you want to delete this certificate? This operation cannot be undone.
ru: Вы уверены, что хотите удалить этот сертификат? Эту операцию нельзя будет отменить.

source: Type new certificate's name
ru: Введите имя нового сертификата

source: Type new container's name
ru: Введите имя нового контейнера

source: Enter your CryptoPRO license key
ru: Введите лицензионный ключ КриптоПРО

source: Creating an HDIMAGE storage
ru: Создание хранилища HDIMAGE

source: Enter the password of the root user
ru: Введите пароль пользователя root

source: Select container from usb-flash
ru: Выбрать контейнер из usb-flash

source: Select container from hdimage
ru: Выбрать контейнер из hdimage

source: Select container from token
ru: Выбрать контейнер из токена

source: Error
ru: Ошибка

source: Information
ru: Информация

source: Select container
ru: Выберите контейнер
